# Row, Column 추가 / 삭제

In [2]:
import pandas as pd
import numpy as np 

path = r'data/titanic.csv'
df = pd.read_csv(path)
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

## 새 column 추가하기
 - [] 사용하여 추가하기
 - insert 함수 사용하여 원하는 위치에 추가하기

In [3]:
df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [4]:
df['Age'] * 2

0      44.0
1      76.0
2      52.0
3      70.0
4      70.0
       ...
886    54.0
887    38.0
888     NaN
889    52.0
890    64.0
Name: Age, Length: 891, dtype: float64

In [5]:
df['Age_Double'] = df['Age'] * 2

In [6]:
df[['Age', 'Age_Double']]

      Age  Age_Double
0    22.0        44.0
1    38.0        76.0
2    26.0        52.0
3    35.0        70.0
4    35.0        70.0
..    ...         ...
886  27.0        54.0
887  19.0        38.0
888   NaN         NaN
889  26.0        52.0
890  32.0        64.0

[891 rows x 2 columns]

In [7]:
df['Age_Tripple'] = df['Age_Double'] + df['Age']

In [8]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_Double,Age_Tripple
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,44.0,66.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,76.0,114.0

### insert() 
원하는 위치에 컬럼 추가

In [9]:
df.insert(3, 'Fare10', df['Fare'] / 10)
df.head(2)

,PassengerId,Survived,Pclass,Fare10,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_Double,Age_Tripple
0,1,0,3,0.72500,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,44.0,66.0
1,2,1,1,7.12833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,76.0,114.0

## column 삭제하기
 - drop 함수 사용하여 삭제
   - axis= 사용
   - 리스트를 사용하여 멀티플 삭제 가능

In [15]:
# 1차원 0 
# 2차원 0 = 행, 1 = 열

In [17]:
df.drop('Age_Tripple', axis=1)

,PassengerId,Survived,Pclass,Fare10,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_Double
0,1,0,3,0.72500,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,44.0
1,2,1,1,7.12833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,76.0
2,3,1,3,0.79250,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,52.0
3,4,1,1,5.31000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,70.0
4,5,0,3,0.80500,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,70.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,1.30000,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,54.0
887,888,1,1,3.00000,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,38.0
888,889,0,3,2.34500,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,NaN
889,890,1,1,3.00000,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,52.0
890,891,0,3,0.77500,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,64.0

In [18]:
df.head(2)

,PassengerId,Survived,Pclass,Fare10,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_Double,Age_Tripple
0,1,0,3,0.72500,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,44.0,66.0
1,2,1,1,7.12833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,76.0,114.0

In [19]:
df.drop(['Age_Double', 'Age_Tripple'], axis=1, inplace=True)

In [20]:
df.head(2)

,PassengerId,Survived,Pclass,Fare10,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,0.72500,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,7.12833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

## 행 (row) 추가 삭제
- 추가 loc[]
- 삭제 drop()

In [ ]:
df2 = pd.DataFrame([
    [1,2,3,4],
    [5,6,7,8],
    [9,10,11,12]
], index=['홍길동','이순신','김유신'], 
columns=['a','b','c','d'])

In [23]:
df2

     a   b   c   d
홍길동  1   2   3   4
이순신  5   6   7   8
김유신  9  10  11  12

In [24]:
df2.loc['홍길동']

a    1
b    2
c    3
d    4
Name: 홍길동, dtype: int64

In [25]:
df2.iloc[0]

a    1
b    2
c    3
d    4
Name: 홍길동, dtype: int64

In [26]:
df2.loc['유관순'] = pd.Series([100,200,300,400], ['a','b','c','d'])
df2

       a    b    c    d
홍길동    1    2    3    4
이순신    5    6    7    8
김유신    9   10   11   12
유관순  100  200  300  400

In [27]:
df2.loc['김좌진'] = [101,102,103,104]
df2

       a    b    c    d
홍길동    1    2    3    4
이순신    5    6    7    8
김유신    9   10   11   12
유관순  100  200  300  400
김좌진  101  102  103  104

In [28]:
df2.drop('김좌진')

       a    b    c    d
홍길동    1    2    3    4
이순신    5    6    7    8
김유신    9   10   11   12
유관순  100  200  300  400

In [29]:
df2

       a    b    c    d
홍길동    1    2    3    4
이순신    5    6    7    8
김유신    9   10   11   12
유관순  100  200  300  400
김좌진  101  102  103  104

In [30]:
df2.drop('김좌진', inplace=True)
df2

       a    b    c    d
홍길동    1    2    3    4
이순신    5    6    7    8
김유신    9   10   11   12
유관순  100  200  300  400

In [33]:
df2.iloc[3] = [111,222,333,444]
df2

       a    b    c    d
홍길동    1    2    3    4
이순신    5    6    7    8
김유신    9   10   11   12
유관순  111  222  333  444

#### 행 삽입

In [36]:
df2.values

array([[  1,   2,   3,   4],
       [  5,   6,   7,   8],
       [  9,  10,  11,  12],
       [111, 222, 333, 444]])

In [39]:
new_data = np.insert(df2.values, 2, values=[10,20,30,40], axis=0)
new_data

array([[  1,   2,   3,   4],
       [  5,   6,   7,   8],
       [ 10,  20,  30,  40],
       [  9,  10,  11,  12],
       [111, 222, 333, 444]])

In [40]:
new_index = np.insert(df2.index, 2, '김좌진')
new_index

Index(['홍길동', '이순신', '김좌진', '김유신', '유관순'], dtype='object')

In [41]:
pd.DataFrame(
    data = new_data,
    columns= df2.columns,
    index= new_index
)

       a    b    c    d
홍길동    1    2    3    4
이순신    5    6    7    8
김좌진   10   20   30   40
김유신    9   10   11   12
유관순  111  222  333  444